In [14]:
from pydataset import data
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [15]:
data = np.array([[1, 2, 3], [4, 5, 6]])

df = pd.DataFrame(data)

In [16]:
df.columns = ['a', 'b', 'c']

In [17]:
df

   a  b  c
0  1  2  3
1  4  5  6

In [18]:
df = pd.DataFrame(data, columns=['a', 'b', 'c'])

In [19]:
df

   a  b  c
0  1  2  3
1  4  5  6

In [20]:
from env import host, user, password

In [31]:
db_name = "employees"

In [32]:
url = f"mysql+pymysql://{user}:{password}@{host}/{db_name}"

In [33]:
df = pd.read_sql("SELECT * FROM employees LIMIT 5", url)

In [34]:
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12